## Ex2 - Getting and knowing your Data


## Step 1. Go to Dataset_link/titanic.csv)
This dataset for Titanic passenger details
Having columns are survived,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked
Some passengers were not found in their details (missing values are present)
## Step 2. Use the Csv file and assign it to a dataframe called titan_data

In [3]:
import pandas as pd
import numpy as np
titan_data=pd.read_csv("titanic_csv.csv")
titan_data.head()

   Unnamed: 0                                               Name     Sex  Age
0           0                            Braund, Mr. Owen Harris    male   22
1           1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female   38
2           2                             Heikkinen, Miss. Laina  female   26
3           3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female   35
4           4                           Allen, Mr. William Henry    male   35

## Step 3. What is the number of observations and entries in the dataset?

In [4]:
titan_data.count()

Unnamed: 0    5
Name          5
Sex           5
Age           5
dtype: int64

## Step 4. Check the missing values and non-missing values for every individual label

In [5]:
titan_data.isna().sum()

Unnamed: 0    0
Name          0
Sex           0
Age           0
dtype: int64

In [6]:
titan_data.notnull().sum()

Unnamed: 0    5
Name          5
Sex           5
Age           5
dtype: int64

## Step 5. Replace missing values with mean value,If label having numerics data and assign it to a new dataframe named as titan_df

In [7]:
titan_df=titan_data.replace(to_replace=np.nan,value=titan_data.mean())
titan_df.head()

   Unnamed: 0                                               Name     Sex  Age
0           0                            Braund, Mr. Owen Harris    male   22
1           1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female   38
2           2                             Heikkinen, Miss. Laina  female   26
3           3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female   35
4           4                           Allen, Mr. William Henry    male   35

In [8]:
titan_df.isna().sum()

Unnamed: 0    0
Name          0
Sex           0
Age           0
dtype: int64

## Step 6. In titan_df, Replace missing values with mode value, if label having categorical data (object type)

In [9]:
for column in titan_df.columns:
    titan_df[column].fillna(titan_df[column].mode()[0],inplace=True)

## Step 7. Now, check the missing values in titan_df

In [10]:
titan_df.isna().sum()

Unnamed: 0    0
Name          0
Sex           0
Age           0
dtype: int64

## Step 8. Finally, Export titan_df to "cleaned_titan_df.xlsx"

In [11]:
titan_df.to_excel("cleaned_titan_df.xlsx",encoding='utf-8')

## Task:
Take same Dataset
Follow same steps by using Data imputation technique.
Export final dataset to "cleaned_titan_df.csv"

In [13]:
titan_data=pd.read_csv("titanic_csv.csv")
titan_data.head()

   Unnamed: 0                                               Name     Sex  Age
0           0                            Braund, Mr. Owen Harris    male   22
1           1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female   38
2           2                             Heikkinen, Miss. Laina  female   26
3           3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female   35
4           4                           Allen, Mr. William Henry    male   35

In [14]:
titan_data.count()

Unnamed: 0    5
Name          5
Sex           5
Age           5
dtype: int64

In [15]:
titan_data.isna().sum()

Unnamed: 0    0
Name          0
Sex           0
Age           0
dtype: int64

In [16]:
from sklearn.impute import SimpleImputer

In [17]:
si=SimpleImputer(strategy="mean")

In [18]:
si.fit(titan_data[["Age"]])

SimpleImputer()

In [19]:
age=si.transform(titan_data[['Age']])

In [20]:
titan_df=titan_data
titan_df['Age']=age
titan_df.head()

   Unnamed: 0                                               Name     Sex   Age
0           0                            Braund, Mr. Owen Harris    male  22.0
1           1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
2           2                             Heikkinen, Miss. Laina  female  26.0
3           3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
4           4                           Allen, Mr. William Henry    male  35.0

In [21]:
titan_df.isna().sum()

Unnamed: 0    0
Name          0
Sex           0
Age           0
dtype: int64

In [22]:
med=SimpleImputer(strategy="most_frequent")
med.fit(titan_df)

SimpleImputer(strategy='most_frequent')

In [23]:
df=med.transform(titan_df)

In [24]:
titan_df=pd.DataFrame(df,columns=titan_df.columns)
titan_df.head()

  Unnamed: 0                                               Name     Sex Age
0          0                            Braund, Mr. Owen Harris    male  22
1          1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38
2          2                             Heikkinen, Miss. Laina  female  26
3          3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35
4          4                           Allen, Mr. William Henry    male  35

In [25]:
titan_df.isna().sum()

Unnamed: 0    0
Name          0
Sex           0
Age           0
dtype: int64

In [26]:
titan_df.to_csv("cleaned_titan_df.csv")

## Data imputation
Standard deviation

In [27]:
titan_data=pd.read_csv("titanic_csv.csv")
titan_data.head()

   Unnamed: 0                                               Name     Sex  Age
0           0                            Braund, Mr. Owen Harris    male   22
1           1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female   38
2           2                             Heikkinen, Miss. Laina  female   26
3           3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female   35
4           4                           Allen, Mr. William Henry    male   35

In [28]:
from sklearn.preprocessing import scale

In [29]:
titan_data.columns

Index(['Unnamed: 0', 'Name', 'Sex', 'Age'], dtype='object')

In [31]:
titan_df.mean()

Unnamed: 0     2.0
Age           31.2
dtype: float64

In [32]:
titan_df.std()

Unnamed: 0    1.581139
Age           6.833740
dtype: float64

In [33]:
titan_df.isna().sum()

Unnamed: 0    0
Name          0
Sex           0
Age           0
dtype: int64

In [34]:
titan_df=titan_df.replace(to_replace=np.nan,value=titan_df.mean())

In [35]:
titan_df.isna().sum()

Unnamed: 0    0
Name          0
Sex           0
Age           0
dtype: int64

In [36]:
import seaborn as sns
sns.set(style="darkgrid")

In [39]:
from sklearn.preprocessing import MinMaxScaler
mms=MinMaxScaler()

In [42]:
titan_df=titan_df.replace(to_replace=np.nan,value=titan_df.mean())

In [43]:
titan_df.isna().sum()

Unnamed: 0    0
Name          0
Sex           0
Age           0
dtype: int64